Revit 2027 API
Family.ExtractPartAtom Method
 Writes a PartAtom XML from the contents of a family object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ExtractPartAtom(
	string xmlFilePath
)
Public Sub ExtractPartAtom (
	xmlFilePath As String
)
public:
void ExtractPartAtom(
	String^ xmlFilePath
)
member ExtractPartAtom :
        xmlFilePath : string -> unit
Parameters
xmlFilePath String
The xml file to be saved.
Exceptions
Exception | Condition
ArgumentException | If 'xmlFilePath' is null or an empty string.
Remarks
 This method is designed for a family loaded into a document in session. So it will skip the type catalog file. To extract the PartAtom XML from a family file on disk, use Application.ExtractPartAtomFromFamilyFile()
See Also
Reference
Family Class
Autodesk.Revit.DB Namespace